import {parseTableFormatAbilityRenovation} from "./parseTableFormatAbilityRenovation"

describe("test table parser", () => {
  test("test the func with real valid data", () => {
    const text = "名称 ,仕様・規格 ,単 位 ,数 量  ,単価 ,金 額  ,備考 \n" +
      "仮設工事 ,養生工事箇所屋内屋外 ,式 ,1  ,,19000  ,材工共 \n" +
      "解体工事 ,２階出入口コロニアル屋根（ｱｽﾍﾞｽﾄ含）野地板垂木等 ,式 ,1  ,,91000  ,\n" +
      "木工事 ,玄関屋根下地外壁補修２階バルコニー出入口廻り屋内外 ,式 ,1  ,,278000  ,材工共 \n" +
      "ﾊﾞﾙｺﾆｰ入口ｻｯｼ工事 ,LIXILﾌﾗｯｼｭﾄﾞｱ設置 W650H1820ｻｯｼ定価￥57900 ,式 ,1  ,,51000  ,運搬設置費含む \n" +
      "１階玄関屋根工事 ,アスファルトルーフィング板金屋根張り１寸勾配 ,式 ,1  ,,169000  ,材工共 \n" +
      ",新規鼻先雨樋設置 ,〃 ,1  ,,51000  ,材工共 \n" +
      "バルコニー工事 ,ﾊﾞﾙｺﾆｰ本体LIXILﾋﾞｭｰｽﾃｰｼﾞHｽﾀｲﾙ2階柱建式 ,,,,,\n" +
      ",1棟9尺×２．０間縦スリットセット定価￥1326500 ,式 ,1  ,,720000  ,\n" +
      ",上記設置費 ,〃 ,1  ,,225000  ,\n" +
      "内装工事 ,ﾊﾞﾙｺﾆｰ出入口屋内壁1面 ,式 ,1  ,,23000  ,材工共 \n" +
      "産業廃棄処分費 ,解体材及び発生材 ,式 ,1  ,,29000  ,運搬費含む \n" +
      "【総合計】 ,,,,,1656000  ,\n" +
      "以下余白 ,,,,,,\n"
    expect(parseTableFormatAbilityRenovation(text)).toEqual({
      "rowNames": [
        "仮設工事",
        "解体工事",
        "木工事",
        "ﾊﾞﾙｺﾆｰ入口ｻｯｼ工事",
        "１階玄関屋根工事",
        "",
        "バルコニー工事",
        "",
        "",
        "内装工事",
        "産業廃棄処分費",
        "【総合計】",
        "以下余白"
      ],
      "specifications": [
        "養生工事箇所屋内屋外",
        "２階出入口コロニアル屋根（ｱｽﾍﾞｽﾄ含）野地板垂木等",
        "玄関屋根下地外壁補修２階バルコニー出入口廻り屋内外",
        "LIXILﾌﾗｯｼｭﾄﾞｱ設置 W650H1820ｻｯｼ定価￥57900",
        "アスファルトルーフィング板金屋根張り１寸勾配",
        "新規鼻先雨樋設置",
        "ﾊﾞﾙｺﾆｰ本体LIXILﾋﾞｭｰｽﾃｰｼﾞHｽﾀｲﾙ2階柱建式",
        "1棟9尺×２．０間縦スリットセット定価￥1326500",
        "上記設置費",
        "ﾊﾞﾙｺﾆｰ出入口屋内壁1面",
        "解体材及び発生材",
        "",
        ""
      ],
      "units": [
        "式",
        "式",
        "式",
        "式",
        "式",
        "〃",
        "",
        "式",
        "〃",
        "式",
        "式",
        "",
        ""
      ],
      "quantities": [
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "",
        "1",
        "1",
        "1",
        "1",
        "",
        ""
      ],
      "pricePerUnits": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "prices": [
        "19000",
        "91000",
        "278000",
        "51000",
        "169000",
        "51000",
        "",
        "720000",
        "225000",
        "23000",
        "29000",
        "1656000",
        ""
      ],
      "notes": [
        "材工共",
        "",
        "材工共",
        "運搬設置費含む",
        "材工共",
        "材工共",
        "",
        "",
        "",
        "材工共",
        "運搬費含む",
        "",
        ""
      ]
    })
  })
})